<a href="https://colab.research.google.com/github/sharop/CD2001C/blob/main/sandbox/warming_up.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


# Explorando SQLite y Python mediante Golaboratory
---
Este notebook nos ayudara a:
* Cosas escenciales para la clase.
* Familiarizarse con la conexion de SQLite, Notebook y Python.
* Caja de arena.

#### Conexi√≥n a Google Drive

In [1]:

from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [19]:
%load_ext sql

In [25]:
%%sql
sqlite:////content/drive/MyDrive/my_db/my_db.db

In [26]:
%%sql
SELECT name FROM sqlite_master WHERE type = 'table'

 * sqlite:////content/drive/MyDrive/my_db/my_db.db
Done.

[('category',), ('subcategory',), ('student',)]

In [27]:
%%sql
SELECT * FROM student

 * sqlite:////content/drive/MyDrive/my_db/my_db.db
Done.

[(1, 'John Deo', 'Four', 75, 'female'),
 (2, 'Max Ruin', 'Three', 85, 'male'),
 (3, 'Arnold', 'Three', 55, 'male'),
 (4, 'Krish Star', 'Four', 60, 'female'),
 (5, 'John Mike', 'Four', 60, 'female'),
 (6, 'Alex John', 'Four', 55, 'male'),
 (7, 'My John Rob', 'Five', 78, 'male'),
 (8, 'Asruid', 'Five', 85, 'male'),
 (9, 'Tes Qry', 'Six', 78, 'male'),
 (10, 'Big John', 'Four', 55, 'female'),
 (11, 'Ronald', 'Six', 89, 'female'),
 (12, 'Recky', 'Six', 94, 'female'),
 (13, 'Kty', 'Seven', 88, 'female'),
 (14, 'Bigy', 'Seven', 88, 'female'),
 (15, 'Tade Row', 'Four', 88, 'male'),
 (16, 'Gimmy', 'Four', 88, 'male'),
 (17, 'Tumyu', 'Six', 54, 'male'),
 (18, 'Honny', 'Five', 75, 'male'),
 (19, 'Tinny', 'Nine', 18, 'male'),
 (20, 'Jackly', 'Nine', 65, 'female'),
 (21, 'Babby John', 'Four', 69, 'female'),
 (22, 'Reggid', 'Seven', 55, 'female'),
 (23, 'Herod', 'Eight', 79, 'male'),
 (24, 'Tiddy Now', 'Seven', 78, 'male'),
 (25, 'Giff Tow', 'Seven', 88, 'male'),
 (26, 'Crelea', 'Seven', 79, 'male'),
 (27, 'Big Nose', 'Three', 81, 'female'),
 (28, 'Rojj Base', 'Seven', 86, 'female'),
 (29, 'Tess Played', 'Seven', 55, 'male'),
 (30, 'Reppy Red', 'Six', 79, 'female'),
 (31, 'Marry Toeey', 'Four', 88, 'male'),
 (32, 'Binn Rott', 'Seven', 90, 'female'),
 (33, 'Kenn Rein', 'Six', 96, 'female'),
 (34, 'Gain Toe', 'Seven', 69, 'male'),
 (35, 'Rows Noump', 'Six', 88, 'female')]

# Introducci√≥n a SQL
<details>
  <summary>Cheat Sheet 1</summary>
  
![Cheat Sheet 1](https://learnsql.com/blog/sql-basics-cheat-sheet/sql-basics-cheat-sheet-a4-page-1.png)
</details>

<details>
  <summary>Cheat Sheet 2</summary>

![Cheat Sheet 2](https://learnsql.com/blog/sql-basics-cheat-sheet/sql-basics-cheat-sheet-a4-page-2.png)
</details>

In [23]:
from sqlalchemy import create_engine
engine=create_engine("sqlite:////content/drive/MyDrive/my_db/my_db.db")

In [24]:
with engine.connect() as conn:
    result = conn.execute('''SELECT name FROM sqlite_master WHERE type = 'table' ''')

ObjectNotExecutableError: ignored

In [18]:
r_set=my_conn.execute('''select name from sqlite_master
		where type = 'table' ''')
for row in r_set:
    print(row)

AttributeError: ignored

In [ ]:
r_set=my_conn.execute('''SELECT * from student''');
for row in r_set:
    print(row)